tests/Fixtures/PaymentTest/payment_service_response.json

{
    "url": "http://localhost",
    "entity": {
        "payment_id": "22d6d597-000f-5000-9000-145f6df21d6f",
        "status": "pending",
        "is_paid": false,
        "amount": "2.00",
        "currency": "RUB",
        "started_at": "2018-07-10 14:25:27",
        "description": "Заказ №1"
    }
}
